In [2]:
# filter missing data from a Series
from numpy import nan as NA

In [3]:
import pandas as pd

In [4]:
import numpy as np

In [5]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [6]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [7]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
# on a DataFrame, dropna by default drops any row that contains an NA value
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])

In [9]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [10]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [11]:
# only drop rows that are ALL NA - use how='all'
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [12]:
# remember axis=1 means work on columns
data[4] = NA

In [13]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [14]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [15]:
# keep only rows that have a certain number of observations
df = pd.DataFrame(np.random.randn(7, 3))

In [16]:
df

          0         1         2
0  0.677697 -1.012253  0.743554
1 -0.031366  0.785442  0.319150
2  0.764794  1.611985  0.411506
3 -0.964198  0.504202  0.195457
4 -1.155343 -0.538658  1.673973
5  0.602471  1.035270  0.017283
6 -1.256559  0.652442  0.745002

In [17]:
# first 4 rows of column 1 are missing
df.iloc[:4, 1] = NA

In [18]:
# first 2 rows of column 2 are missing
df.iloc[:2, 2] = NA

In [19]:
df

          0         1         2
0  0.677697       NaN       NaN
1 -0.031366       NaN       NaN
2  0.764794       NaN  0.411506
3 -0.964198       NaN  0.195457
4 -1.155343 -0.538658  1.673973
5  0.602471  1.035270  0.017283
6 -1.256559  0.652442  0.745002

In [20]:
# keep rows with 2 or more observations
df.dropna(thresh=2)

          0         1         2
2  0.764794       NaN  0.411506
3 -0.964198       NaN  0.195457
4 -1.155343 -0.538658  1.673973
5  0.602471  1.035270  0.017283
6 -1.256559  0.652442  0.745002

In [21]:
# without thresh setting
df.dropna()

          0         1         2
4 -1.155343 -0.538658  1.673973
5  0.602471  1.035270  0.017283
6 -1.256559  0.652442  0.745002

In [22]:
# use fillna to fill in missing data
# a constant uses that value to replace
df.fillna(0)

          0         1         2
0  0.677697  0.000000  0.000000
1 -0.031366  0.000000  0.000000
2  0.764794  0.000000  0.411506
3 -0.964198  0.000000  0.195457
4 -1.155343 -0.538658  1.673973
5  0.602471  1.035270  0.017283
6 -1.256559  0.652442  0.745002

In [23]:
# pass in a dict to have a different value for each column
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  0.677697  0.500000  0.000000
1 -0.031366  0.500000  0.000000
2  0.764794  0.500000  0.411506
3 -0.964198  0.500000  0.195457
4 -1.155343 -0.538658  1.673973
5  0.602471  1.035270  0.017283
6 -1.256559  0.652442  0.745002

In [24]:
# fillna returns a new object
# you can modify in place
_ = df.fillna(0, inplace=True)

In [25]:
df

          0         1         2
0  0.677697  0.000000  0.000000
1 -0.031366  0.000000  0.000000
2  0.764794  0.000000  0.411506
3 -0.964198  0.000000  0.195457
4 -1.155343 -0.538658  1.673973
5  0.602471  1.035270  0.017283
6 -1.256559  0.652442  0.745002

In [26]:
# you can use interpolation methods to fill. 'ffill' is forward fill
df = pd.DataFrame(np.random.randn(6, 3))

In [27]:
df.iloc[2:, 1] = NA

In [28]:
df.iloc[4:, 2] = NA

In [29]:
df

          0         1         2
0  0.354342 -1.082274  1.796101
1  1.080994 -1.203431  1.311923
2  1.386137       NaN  0.248696
3  0.075186       NaN -0.603889
4  1.757473       NaN       NaN
5  0.576287       NaN       NaN

In [30]:
df.fillna(method='ffill')

          0         1         2
0  0.354342 -1.082274  1.796101
1  1.080994 -1.203431  1.311923
2  1.386137 -1.203431  0.248696
3  0.075186 -1.203431 -0.603889
4  1.757473 -1.203431 -0.603889
5  0.576287 -1.203431 -0.603889

In [31]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.354342 -1.082274  1.796101
1  1.080994 -1.203431  1.311923
2  1.386137 -1.203431  0.248696
3  0.075186 -1.203431 -0.603889
4  1.757473       NaN -0.603889
5  0.576287       NaN -0.603889

In [32]:
# you can fill with the mean value for a series
data = pd.Series([1., NA, 3.5, NA, 7])

In [33]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [34]:
# working with duplicate data
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})

In [35]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [36]:
# duplicated() checks if a row has been seen in a previous row
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [37]:
# drop_duplicates() removes the duplicated rows
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [38]:
data['v1'] = range(7)

In [39]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [40]:
# duplicated and drop_duplicates can take a list of columns to include
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [41]:
# duplicated and drop_duplicates take the first observation
# use keep='last' to take the last observation
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [42]:
# transforming data using a function or mapping
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [43]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [44]:
# let's add a column that shows which animal each food came from
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [45]:
# need to convert the foods to lowercase
lowercased = data['food'].str.lower()

In [46]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [47]:
data['animal'] = lowercased.map(meat_to_animal)

In [48]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [49]:
# or use a function and map()
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [50]:
# replacing values
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [51]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [52]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [53]:
# can replace multiple values
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [54]:
# can also replace with a list of substitutes
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [55]:
# replace arg can also be a dict
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [56]:
# renaming axis indexes
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [57]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [58]:
data.index

Index(['Ohio', 'Colorado', 'New York'], dtype='object')

In [59]:
transform = lambda x: x[:4].upper()

In [60]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [61]:
data.index = data.index.map(transform)

In [62]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [63]:
# rename the row and column names - does not change the original
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [64]:
# rename with dicts to replace a subset of labels
data.rename(index={'OHIO': 'INDIANA'},
           columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [65]:
# you can modify inplace
data.rename(index={'OHIO': 'MAINE'}, inplace=True)

In [66]:
data

       one  two  three  four
MAINE    0    1      2     3
COLO     4    5      6     7
NEW      8    9     10    11

In [67]:
# Categorize and binning (bins)
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [68]:
# split the data into bins
# 4 bins needs 5 edges
# bins are 18-25, 26-35, 36-60, 61-100
bins = [18, 25, 35, 60, 100]

In [69]:
cats = pd.cut(ages, bins)

In [70]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [71]:
# instead of a list of edges, you can specify the number of bins you want
cats2 = pd.cut(ages, 4)

In [72]:
# the bin edges here are evenly spaced between the lowest and highest values in the data set
cats2

[(19.959, 30.25], (19.959, 30.25], (19.959, 30.25], (19.959, 30.25], (19.959, 30.25], ..., (30.25, 40.5], (50.75, 61.0], (40.5, 50.75], (40.5, 50.75], (30.25, 40.5]]
Length: 12
Categories (4, interval[float64]): [(19.959, 30.25] < (30.25, 40.5] < (40.5, 50.75] < (50.75, 61.0]]

In [73]:
# internally cats is a Category object
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [74]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [75]:
# how many age items are in each bin?
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [76]:
# for the intervals, you can change which end is closed (inclusive, shows as bracket)
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [77]:
# you can label the bins
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [78]:
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [79]:
# with cut, you probably wont get the same number of items in each bin
# if that is what you want, use qcut
data = np.random.randn(1000)  # Normally distributed

In [80]:
cats = pd.qcut(data, 4)   # cut into quartiles

In [81]:
cats

[(-0.0114, 0.698], (-0.0114, 0.698], (-3.9099999999999997, -0.688], (-0.0114, 0.698], (-0.688, -0.0114], ..., (-0.0114, 0.698], (-0.0114, 0.698], (-3.9099999999999997, -0.688], (-0.0114, 0.698], (-0.0114, 0.698]]
Length: 1000
Categories (4, interval[float64]): [(-3.9099999999999997, -0.688] < (-0.688, -0.0114] < (-0.0114, 0.698] < (0.698, 2.823]]

In [82]:
pd.value_counts(cats)

(0.698, 2.823]                   250
(-0.0114, 0.698]                 250
(-0.688, -0.0114]                250
(-3.9099999999999997, -0.688]    250
dtype: int64

In [149]:
# detecting and filtering outliers
data = pd.DataFrame(np.random.randn(1000, 4))

In [150]:
data.head()

          0         1         2         3
0  1.007189 -1.296221  0.274992  0.228913
1  1.352917  0.886429 -2.001637 -0.371843
2  1.669025 -0.438570 -0.539741  0.476985
3  3.248944 -1.021228 -0.577087  0.124121
4  0.302614  0.523772  0.000940  1.343810

In [151]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.025619    -0.002790    -0.069612     0.065019
std       1.006798     0.996797     0.996400     0.991650
min      -3.184377    -3.745356    -3.428254    -3.548824
25%      -0.641675    -0.644144    -0.774890    -0.596286
50%       0.002073    -0.014664    -0.117489     0.094503
75%       0.680391     0.654328     0.611729     0.777558
max       3.260383     3.927528     3.366626     2.653656

In [152]:
data.index

RangeIndex(start=0, stop=1000, step=1)

In [156]:
data.where(data[2] > 0).dropna()

            0         1         2         3
0    1.007189 -1.296221  0.274992  0.228913
4    0.302614  0.523772  0.000940  1.343810
9    0.377984 -0.753887  0.331286  1.349742
12   0.758363 -0.660524  0.862580 -0.010032
13   0.050009  0.670216  0.852965 -0.955869
..        ...       ...       ...       ...
990 -0.677870 -1.466596  0.957144  0.377342
991 -0.383241  1.101972  1.221058 -0.326481
992  0.750008  0.604072  1.089085  0.251232
996 -0.782960 -0.303340  0.089987  0.292291
997  1.177706  0.882755  1.150765 -0.997174

[453 rows x 4 columns]

In [86]:
# find values in one of the columns exceeding 3 in abs value
col = data[2]

In [87]:
col[np.abs(col) > 3]

665    3.241463
928    3.121458
Name: 2, dtype: float64

In [88]:
# to select all rows containing a value exceed abs(3) use any()
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
98   0.651906 -0.955512 -2.210915 -3.115448
342  3.699042  1.560209  0.338083  0.086544
429  0.762037 -1.086796  0.238485 -3.048638
492  3.055894  1.585283 -1.400065 -0.796182
588  0.445820  1.569845 -0.083634 -3.070038
593  3.245474 -2.249018  0.495199  0.603122
623 -0.901726  3.061915 -1.382381  1.452969
630  1.448393  1.080597  1.098341  3.227561
632 -0.413545  0.536441 -0.238040  3.829394
665  0.916020 -0.670950  3.241463  0.212589
848  0.078989 -1.912545 -0.302543  3.543471
928  0.245226 -0.382152  3.121458  0.396497
931 -0.771526 -1.875093 -0.959933 -3.826989

In [89]:
# cap values outside the -3 to 3 interval
# np.sign() produces 1 and -1 values depending if the data is positive or negative
data[np.abs(data) > 3] = np.sign(data) * 3

In [90]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.010808     0.049640    -0.024946    -0.019654
std       1.003133     1.002204     1.002241     0.990920
min      -2.727271    -2.904795    -2.901558    -3.000000
25%      -0.660996    -0.637000    -0.728246    -0.674548
50%       0.006565     0.008026    -0.034526    -0.001409
75%       0.653925     0.731732     0.646698     0.641138
max       3.000000     3.000000     3.000000     3.000000

In [91]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0 -1.0  1.0
1  1.0  1.0  1.0  1.0
2 -1.0  1.0  1.0 -1.0
3 -1.0  1.0  1.0  1.0
4  1.0 -1.0  1.0 -1.0

In [92]:
# Permutation and random sampling
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [93]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [94]:
# get row numbers 0-4 in a random order
sampler = np.random.permutation(5)

In [95]:
sampler

array([4, 2, 0, 1, 3])

In [96]:
df.take(sampler)

    0   1   2   3
4  16  17  18  19
2   8   9  10  11
0   0   1   2   3
1   4   5   6   7
3  12  13  14  15

In [97]:
# select a random subset without replacement
df.sample(n=3)

    0   1   2   3
1   4   5   6   7
3  12  13  14  15
0   0   1   2   3

In [98]:
# to generate a sample with replacement (to allow repeat choices) pass replace=True
choices = pd.Series([5, 7, -1, 6, 4])

In [99]:
draws = choices.sample(n=10, replace=True)

In [100]:
draws

0    5
1    7
3    6
0    5
1    7
0    5
1    7
4    4
3    6
1    7
dtype: int64

In [101]:
# computing indicator or dummy variables
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})

In [102]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [103]:
# generate an indicator matrix
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [104]:
# you can prefix the column names
dummies = pd.get_dummies(df['key'], prefix='key')

In [105]:
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [106]:
# and merge it
df_with_dummy = df[['data1']].join(dummies)

In [107]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [108]:
# dealing with multiple categories
mnames = ['movie_id', 'title', 'genres']

In [109]:
movies = pd.read_table('datasets/movies.dat', sep='::',
                       header=None, names=mnames, engine='python')

In [110]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [111]:
# first get the list of unique genres
all_genres = []

In [112]:
for x in movies.genres:
    all_genres.extend(x.split('|'))

In [113]:
genres = pd.unique(all_genres)

In [114]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [115]:
# start with a data frame of all zeroes
zero_matrix = np.zeros((len(movies), len(genres)))

In [116]:
dummies = pd.DataFrame(zero_matrix, columns=genres)

In [117]:
dummies

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [118]:
# use dummies.columns to compute the column indices for each genre
# try with first movie
gen = movies.genres[0]

In [119]:
gen.split('|')

['Animation', "Children's", 'Comedy']

In [120]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2])

In [121]:
# use .iloc to set values based on these indices
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [122]:
# combine it with movies
movies_windic = movies.join(dummies.add_prefix('Genre_'))

In [123]:
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
Genre_Action                                   0
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, dtype: object

In [124]:
# a useful recipe is to combine get_dummies with cut
np.random.seed(12345)

In [125]:
values = np.random.rand(10)

In [126]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [127]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [128]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

In [129]:
# string functions in pandas
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}

In [130]:
data = pd.Series(data)

In [131]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [132]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [133]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [134]:
# a regular expression to take apart emails
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [135]:
import re

In [136]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [137]:
matches = data.str.findall(pattern, flags=re.IGNORECASE).str[0]

In [138]:
matches

Dave     (dave, google, com)
Steve    (steve, gmail, com)
Rob        (rob, gmail, com)
Wes                      NaN
dtype: object

In [139]:
matches.str.get(1)

Dave     google
Steve     gmail
Rob       gmail
Wes         NaN
dtype: object

In [140]:
# you can slice strings
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

In [141]:
# the extract method will return the captured groups of a regex into a data frame
data.str.extract(pattern, flags=re.IGNORECASE)

           0       1    2
Dave    dave  google  com
Steve  steve   gmail  com
Rob      rob   gmail  com
Wes      NaN     NaN  NaN

In [142]:
d = {
    '1': 'Alice',
    '2': 'Bob',
    '3': 'Rita',
    '4': 'Molly',
     '5': 'Ryan'
}
S = pd.Series(d)

In [143]:
S

1    Alice
2      Bob
3     Rita
4    Molly
5     Ryan
dtype: object

In [144]:
S.iloc[0:2]

1    Alice
2      Bob
dtype: object

In [146]:
S.index

Index(['1', '2', '3', '4', '5'], dtype='object')

In [157]:
data = pd.Series([1,3,5,7,9])

In [158]:
data

0    1
1    3
2    5
3    7
4    9
dtype: int64

In [159]:
df = pd.DataFrame(data)

In [160]:
df

   0
0  1
1  3
2  5
3  7
4  9